Revit 2027 API
AnnotationLabelParameterFormatting Properties
The AnnotationLabelParameterFormatting type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LeadingLineBreak |  True if a leading line break should be added the leading spaces, prefix and parameter value.
LeadingSpaces |  The number of spaces to add before the parameter value.
Prefix |  The prefix to add before the parameter value.
SampleText |  The sample text to show in the label in the family environment.
Suffix |  The suffix to add after the parameter value.
Top
See Also
Reference
AnnotationLabelParameterFormatting Class
Autodesk.Revit.DB Namespace